import { Box, Container, Grid } from '@mui/material'
import React from 'react'
import TopSection from '../HeroHeader/TopSection'
import { WrapperPointOfView } from '@/elements/ElementsCustom'
import AccordionUsualQus from './AccordionUsualQus'

const UsualQus = () => {
    return (
        <Box sx={{ my: "4rem" }}>
            <TopSection subTitle='لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است' mainTite='سوالات متداول' />
            <Container>
                <Grid container spacing={3}  alignItems={"center"}>
                    <Grid size={{ md: 6  , xs : 12 }}>
                        <WrapperPointOfView sx={{
                            backgroundPosition: "center",
                        }} >

                            <Box sx={{
                                width: "100%",
                                height: '100%',

                            }}>
                                <img src="/image/landingPage/UsualQus/rightSideImg.png" style={{
                                    objectFit: 'cover',
                                    objectPosition: "center",
                                    height: "100%",
                                    width: "100%"
                                }} alt="" />
                            </Box>
                        </WrapperPointOfView>
                    </Grid>
                    <Grid size={{ md: 6  , xs : 12 }}>
                        <AccordionUsualQus dataAccordion={[
                            { subDisc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد", title: " لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم" },
                            { subDisc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد", title: " لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم" },
                            { subDisc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد", title: " لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم" },
                            { subDisc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد", title: " لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم" },
                            { subDisc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد", title: " لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم" },
                        ]} />
                    </Grid>
                </Grid>
            </Container>
        </Box>
    )
}

export default UsualQus
